import { useRouter } from 'next/router'
import React from 'react';
import Carousel from 'react-elastic-carousel'

const data = [{
    "அ முதல் ஔ வரை": [
        {
            "அ முதல் ஔ வரை/அ": [
                "அகல்.jpg",
                "அச்சு வெல்லம்.jpg",
                "அடுப்பு.jpg",
                "அணில்.jpg",
                "அந்திமல்லி.jpg",
                "அன்னம்.jpg",
                "அப்பளம்.jpg",
                "அம்புலி.jpg",
                "அம்மா.jpg",
                "அம்மி.jpg",
                "அரிசி.jpg",
                "அரும்பு.jpg",
                "அல்லி.jpg"
            ]
        },
        {
            "அ முதல் ஔ வரை/ஆ": [
                "ஆகாயம்.jpg",
                "ஆசிரியர்.jpg",
                "ஆடு.jpg",
                "ஆட்டுக்கல்.jpg",
                "ஆணி.jpg",
                "ஆந்தை.jpg",
                "ஆப்பம்.jpg",
                "ஆமை.jpg",
                "ஆய்தஎழுத்து.jpg",
                "ஆறு.jpg",
                "ஆலங்கட்டி.jpg",
                "ஆலமரம்.jpg"
            ]
        },
        {
            "அ முதல் ஔ வரை/இ": [
                "இஞ்சி.jpg",
                "இடிமின்னல்.jpg",
                "இடியாப்பம்.jpg",
                "இட்லி.jpg",
                "இனிப்பு.jpg",
                "இயற்கை.jpg",
                "இறகு.jpg",
                "இறால்.jpg",
                "இலந்தைபழம்.jpg",
                "இலை.jpg",
                "இல்லம்.jpg",
                "இளநீர்.jpg"
            ]
        },
        {
            "அ முதல் ஔ வரை/ஈ": [
                "ஈ.jpg",
                "ஈகை.jpg",
                "ஈசன்.jpg",
                "ஈசல்.jpg",
                "ஈச்சமரம்.jpg",
                "ஈட்டி.jpg",
                "ஈதல்.jpg",
                "ஈமு.jpg",
                "ஈயம்.jpg",
                "ஈரம்.jpg",
                "ஈரல்.jpg",
                "ஈறு.jpg"
            ]
        },
        {
            "அ முதல் ஔ வரை/உ": [
                "உடை.jpg",
                "உணவு.jpg",
                "உண்டியல்.jpg",
                "உப்பு.jpg",
                "உயிர் எழுத்துக்கள்.jpg",
                "உரல்.jpg",
                "உருளை.jpg",
                "உருளைக்கிழங்கு.jpg",
                "உலகம்.jpg",
                "உலக்கை.jpg",
                "உளி.jpg",
                "உழவர்.jpeg"
            ]
        },
        {
            "அ முதல் ஔ வரை/ஊ": [
                "ஊக்கு.jpg",
                "ஊசி.jpg",
                "ஊஞ்சல்.jpg",
                "ஊதல்.jpg",
                "ஊதா.jpg",
                "ஊத்தாப்பம்.jpg",
                "ஊர்தி.jpg",
                "ஊறுகாய்.jpg"
            ]
        },
        {
            "அ முதல் ஔ வரை/எ": [
                "எடைக்கல்.jpg",
                "எண்கள்.jpg",
                "எரிமலை.gif",
                "எருக்கம்பூ.jpg",
                "எருது.jpg",
                "எறும்பு.jpg",
                "எலி.jpg",
                "எலுமிச்சை.jpeg",
                "எலும்பு.jpg",
                "எள்ளு.jpg",
                "எழுத்தோவியங்கள்.jpg"
            ]
        },
        {
            "அ முதல் ஔ வரை/ஏ": [
                "ஏகபாவம்.jpg",
                "ஏணி.jpg",
                "ஏராளம்.jpg",
                "ஏரி.jpg",
                "ஏறுதல்.jpg",
                "ஏற்றம்.jpg",
                "ஏலக்காய்.jpg",
                "ஏலம்.jpg",
                "ஏளனம்.jpg",
                "ஏவுகணை.jpg"
            ]
        },
        {
            "அ முதல் ஔ வரை/ஐ": [
                "ஐக்கியம்.jpg",
                "ஐங்கோணம்.jpg",
                "ஐந்திணை.jpg",
                "ஐந்து.jpg",
                "ஐம்பூதம்.jpg",
                "ஐயம்.jpg",
                "ஐவனம்.jpg",
                "ஐவிரல்.jpg"
            ]
        },
        {
            "அ முதல் ஔ வரை/ஒ": [
                "ஒட்டகசிவிங்கி.jpg",
                "ஒட்டகம்.jpg",
                "ஒன்று.jpg",
                "ஒப்பந்தம்.jpg",
                "ஒப்பனை.jpg",
                "ஒப்பிடுதல்.jpg",
                "ஒயிலாட்டம்.jpg",
                "ஒற்றுமை.jpg",
                "ஒலி.jpg",
                "ஒலிபெருக்கி.jpg",
                "ஒலிப்பான்.jpg",
                "ஒலிப்பேழை.jpg",
                "ஒளி.jpg"
            ]
        },
        {
            "அ முதல் ஔ வரை/ஔ": [
                "ஒளசீரம்.jpg",
                "ஒளடதம்.jpg",
                "ஒளடும்பரம்.jpg",
                "ஒளதசியம்.jpg",
                "ஒளனம்.jpg",
                "ஒளரங்கசீப்.jpg",
                "ஒளரப்பிரகம்.jpg",
                "ஒளவியம்.jpg",
                "ஔவையார்.jpg"
            ]
        },
        {
            "அ முதல் ஔ வரை/ஓ": [
                "ஒரிதல்தாமரை.jpg",
                "ஓடம்.jpg",
                "ஓடுதல்.jpg",
                "ஓட்டுனர்.jpg",
                "ஓணான்.jpg",
                "ஓநாய்.jpg",
                "ஓமம்.jpg",
                "ஓமவல்லி இலை.jpg",
                "ஓலை.jpg",
                "ஓவியம்.jpg"
            ]
        }
    ]
},
{
    "க முதல் ன வரை": [
        {
            "க முதல் ன வரை/க": [
                "கசப்பு.jpg",
                "கடலை.jpg",
                "கடல்.jpg",
                "கடிகாரம்.jpg",
                "கணினி.jpg",
                "கண்ணாடி.jpg",
                "கதவு.jpg",
                "கதிரவன்.jpg",
                "கனி.jpg",
                "கப்பல்.jpg",
                "கம்பி.jpg",
                "கயிறு.jpg",
                "கருடன்.jpg",
                "கரும்பலகை.jpg",
                "கற்றாழை.jpeg",
                "கலசம்.jpg",
                "கலப்பை.jpg",
                "கழுத்து.jpg"
            ]
        },
        {
            "க முதல் ன வரை/ங": []
        },
        {
            "க முதல் ன வரை/ச": [
                "அரசமரம்.jpg",
                "சக்கரம்.jpg",
                "சங்கிலி.jpg",
                "சங்கு.jpg",
                "சட்டை.jpg",
                "சணல்.jpg",
                "சதகுப்பை.jpg",
                "சந்தனம்.jpg",
                "சந்திரன்.jpg",
                "சர்க்கரை.jpg"
            ]
        },
        {
            "க முதல் ன வரை/ஞ": [
                "ஞமலி.jpg"
            ]
        },
        {
            "க முதல் ன வரை/ட": [
                "உடல்.jpg",
                "ஓடம்.jpg",
                "கடலை.jpg",
                "கடல்.jpg",
                "குடம்.jpg",
                "கூடாரம்.jpg",
                "டமாரம்.jpg",
                "தட்டச்சு.jpg",
                "நடனம்.jpg",
                "படகு.jpeg",
                "பட்டம்.jpg",
                "மடம்.jpg",
                "வட்டம்.jpg",
                "வேடன்.jpg"
            ]
        },
        {
            "க முதல் ன வரை/ண": [
                "ஆபரணம்.jpg",
                "உணவு.jpg",
                "கணக்கு.jpg",
                "கிணறு.jpg",
                "கிண்ணம்.jpg",
                "பணம்.jpg",
                "பௌர்ணமி.jpg",
                "மாணவர்கள்.jpg",
                "வணக்கம்.jpg",
                "வண்ணம்.jpg"
            ]
        },
        {
            "க முதல் ன வரை/த": [
                "தக்காளி.jpg",
                "தங்கம்.jpg",
                "தச்சர்.jpg",
                "தண்டு.jpg",
                "தண்ணீர்.jpg",
                "தந்தம்.jpg",
                "தபால்.jpg",
                "தமிழ்.jpg",
                "தயிர்.jpg",
                "தராசு.jpg",
                "தர்பூசணி.jpg",
                "தவளை.jpg"
            ]
        },
        {
            "க முதல் ன வரை/ந": [
                "நகம்.jpg",
                "நகை.jpg",
                "நங்கூரம்.jpg",
                "நட்சத்திரம்.jpg",
                "நதி.jpg",
                "நத்தை.jpg",
                "நரி.jpg",
                "நல்வரவு.jpg"
            ]
        },
        {
            "க முதல் ன வரை/ன": [
                "அனல்.jpg",
                "ஆசனம்.jpg",
                "கன்னம்.jpg",
                "கானல்.jpg",
                "ஜன்னல்.jpg",
                "தானம்.jpg",
                "புன்னகை.jpg",
                "வனம்.jpg",
                "விமானம்.jpg"
            ]
        },
        {
            "க முதல் ன வரை/ப": [
                "பந்து.jpg",
                "பம்பரம்.jpg",
                "பயிர்.jpg",
                "பருத்தி.jpg",
                "பருந்து.jpg",
                "பருப்பு.jpg",
                "பலா.jpg",
                "பல்.jpg",
                "பல்லி.jpg",
                "பள்ளி.jpg",
                "பழங்கள்.jpg",
                "பழம்.jpg"
            ]
        },
        {
            "க முதல் ன வரை/ம": [
                "மஞ்சள்.jpg",
                "மணி.jpg",
                "மண்.jpg",
                "மத்தளம்.jpg",
                "மன்னர்.jpg",
                "மயில்.jpg",
                "மரம்.jpg",
                "மருதாணி.jpg",
                "மலர்.jpg",
                "மலை.jpg",
                "மல்லி.jpg",
                "மழை.jpg"
            ]
        },
        {
            "க முதல் ன வரை/ய": [
                "குயவன்.jpg",
                "சாயம்.jpg",
                "தாயம்.jpg",
                "நாணயம்.jpg",
                "முயல்.jpg",
                "வயல்.jpg",
                "வெங்காயம்.jpg"
            ]
        },
        {
            "க முதல் ன வரை/ர": [
                "அரசி.jpg",
                "அரளி.jpg",
                "காரம்.jpg",
                "ரசம்.jpg",
                "ரதம்.jpg",
                "ரப்பர்.jpg",
                "ரம்பம்.jpg",
                "ரவை.jpg",
                "விரல்.jpg",
                "வைரம்.jpg"
            ]
        },
        {
            "க முதல் ன வரை/ற": [
                "இறகு.jpg",
                "உறவினர்.jpg",
                "நிறம்.jpg",
                "பறவை.jpg",
                "முறம்.jpg",
                "வறட்சி.jpg",
                "விறகு.jpg"
            ]
        },
        {
            "க முதல் ன வரை/ல": [
                "அலுவலகம்.jpg",
                "ஆலயம்.jpg",
                "உலகம்.jpg",
                "கோலம்.jpg",
                "சிலந்தி.jpg",
                "சிலம்பு.jpg",
                "நீலம்.jpg",
                "பாலம்.jpg",
                "புலவர்.jpg",
                "லட்டு.jpg",
                "விலங்கு.jpg",
                "வெல்லம்.jpg"
            ]
        },
        {
            "க முதல் ன வரை/ள": [
                "அப்பளம்.jpg",
                "அளவு.jpg",
                "இளநீர்.jpeg",
                "குளம்.jpg",
                "பள்ளம்.jpg",
                "பவளம்.jpg",
                "மிளகாய்.jpeg",
                "மிளகு.jpg",
                "மேளம்.jpg",
                "விளக்கு.jpg",
                "வெள்ளம்.jpg"
            ]
        },
        {
            "க முதல் ன வரை/ழ": [
                "ஆழம்.jpg",
                "உழவர்.jpeg",
                "கழனி.jpg",
                "குழந்தை.jpg",
                "குழவி.jpg",
                "தாழம்பூ.jpg",
                "நிழல்.jpg",
                "பழம்.jpg"
            ]
        },
        {
            "க முதல் ன வரை/வ": [
                "வசம்பு.jpg",
                "வடிவம்.jpg",
                "வடை.jpg",
                "வட்டம்.jpg",
                "வண்டி.jpg",
                "வண்டு.jpg",
                "வண்ணத்துபூச்சி.jpg",
                "வனம்.jpg",
                "வயல்.jpg",
                "வலை.jpg",
                "வளையல்.jpg"
            ]
        }
    ]
},
{
    "கா முதல் னா வரை": [
        {
            "கா முதல் னா வரை/கா": [
                "காகம்.jpg",
                "காகிதம்.jpg",
                "காடு.jpg",
                "காடை.jpg",
                "காண்டாமிருகம்.jpg",
                "காப்பு.jpg",
                "காய்.jpg",
                "காராமணி.jpg",
                "காற்றடி.jpg",
                "காற்றலை.jpg",
                "காலை.jpg",
                "கால்.jpg",
                "காளான்.jpg",
                "காளை.jpg",
                "காவடி.jpg",
                "காவலர்.jpg",
                "காவல்நிலையம்.jpg"
            ]
        },
        {
            "கா முதல் னா வரை/ங": []
        },
        {
            "கா முதல் னா வரை/சா": [
                "சாட்டை.jpg",
                "சாதம்.jpg",
                "சாமி.jpg",
                "சாயம்.jpg",
                "சாரம்.jpg",
                "சாரல்.jpg",
                "சாலை.jpg",
                "சாவி.jpg"
            ]
        },
        {
            "கா முதல் னா வரை/ஞா": [
                "ஞானி.jpg",
                "ஞாயிறு.jpg",
                "ஞாலம்.jpg"
            ]
        },
        {
            "கா முதல் னா வரை/டா": [
                "கூடாரம்.jpg",
                "தட்டான்.jpg",
                "பட்டாசு.jpg",
                "பட்டாணி.jpg",
                "பட்டாம்பூச்சி.jpg",
                "பட்டாளம்.jpg",
                "முண்டாசு.jpg"
            ]
        },
        {
            "கா முதல் னா வரை/ணா": [
                "ஓணான்.jpg",
                "கண்ணாடி.jpg"
            ]
        },
        {
            "கா முதல் னா வரை/தா": [
                "தாத்தா.jpg",
                "தானம்.jpg",
                "தானியம்.jpg",
                "தாமரை.jpg",
                "தார்.jpg",
                "தாழம்பூ.jpg",
                "தாழ்ப்பாழ்.jpg",
                "தாவரம்.jpg"
            ]
        },
        {
            "கா முதல் னா வரை/நா": [
                "நாகம்.jpg",
                "நாக்கு.jpg",
                "நாடகம்.JPG",
                "நாடு.jpg",
                "நாட்காட்டி.jpg",
                "நாணயம்.jpg",
                "நாயுருவி.jpg",
                "நாய்.jpg",
                "நாரை.jpg",
                "நார்.jpg",
                "நாற்காலி.jpg"
            ]
        },
        {
            "கா முதல் னா வரை/னா": []
        },
        {
            "கா முதல் னா வரை/பா": [
                "பாகன்.jpg",
                "பாகற்காய்.jpg",
                "பாட்டு.jpg",
                "பாதம்.jpg",
                "பானை.jpg",
                "பாம்பு.jpg",
                "பாய்.jpg",
                "பார்வை.jpg",
                "பாலம்.jpg",
                "பாலை.jpg",
                "பால்.jpg"
            ]
        },
        {
            "கா முதல் னா வரை/மா": [
                "மாடம்.JPG",
                "மாடு.jpg",
                "மாணவர்கள்.jpg",
                "மாது.jpg",
                "மாத்திரை.jpg",
                "மான்.jpg",
                "மாம்பழம்.jpg",
                "மாலை.jpg",
                "மாளிகை.jpg"
            ]
        },
        {
            "கா முதல் னா வரை/யா": [
                "மயானம்.jpg",
                "யானை.jpg",
                "யாமம்.jpg",
                "யாழ்.jpg"
            ]
        },
        {
            "கா முதல் னா வரை/ரா": [
                "ராட்டினம்.jpg"
            ]
        },
        {
            "கா முதல் னா வரை/றா": [
                "இறால்.jpg",
                "கற்றாழை.jpeg",
                "காற்றடி.jpg",
                "காற்றலை.jpg",
                "குற்றாலம்.jpg",
                "சுறா.jpg",
                "புறா.jpg"
            ]
        },
        {
            "கா முதல் னா வரை/லா": [
                "தராசு.jpg",
                "பலா.jpg",
                "ராட்டினம்.jpg"
            ]
        },
        {
            "கா முதல் னா வரை/ளா": [
                "காளான்.jpg",
                "வளாகம்.jpg",
                "வெள்ளாடு.jpg",
                "வேளாண்மை.jpg"
            ]
        },
        {
            "கா முதல் னா வரை/ழா": [
                "குழாய்.jpg",
                "திருவிழா.jpg"
            ]
        },
        {
            "கா முதல் னா வரை/வா": [
                "பல்லாக்கு.jpg",
                "லாடம்.jpg",
                "வாகனம்.jpg",
                "வாசல்.jpg",
                "வாடை.jpg",
                "வாத்து.jpg",
                "வானம்.jpg",
                "வானரம்.jpg",
                "வானூர்தி.jpg",
                "வாய்க்கால்.jpg",
                "வாய்ப்பாடு.jpg",
                "வாரணம்.jpg",
                "வால்.jpg",
                "வாள்.jpg",
                "வாழை.jpg"
            ]
        }
    ]
},
{
    "கி முதல் னி வரை": [
        {
            "கி முதல் னி வரை/கி": [
                "கிணறு.jpg",
                "கிண்ணம்.jpg",
                "கிராமம்.jpg",
                "கிராம்பு.jpg",
                "கிருமி.jpg",
                "கிறிஸ்துமஸ்.jpg",
                "கிலோ.jpg",
                "கிளி.jpg",
                "கிளிஞ்சல்.jpg",
                "கிளை.jpg",
                "கிழங்குகல்.jpg",
                "கிழவன்.jpg",
                "கிழவி.jpg"
            ]
        },
        {
            "கி முதல் னி வரை/சி": [
                "சிங்கம்.jpg",
                "சிறகு.jpg",
                "சிலந்தி.jpg",
                "சிலம்பு.jpg",
                "சிலை.jpg"
            ]
        },
        {
            "கி முதல் னி வரை/ஞி": [
                "தேனீ.jpg"
            ]
        },
        {
            "கி முதல் னி வரை/டி": [
                "இடி.jpg",
                "கடிகாரம்.jpg",
                "கொடி.jpg",
                "சிலந்தி.jpg",
                "செடி.jpg",
                "டீ.jpg",
                "தடி.jpg",
                "படிகாரம்.jpg",
                "பெட்டி.jpg",
                "வண்டி.jpg"
            ]
        },
        {
            "கி முதல் னி வரை/ணி": [
                "அணில்.jpg",
                "ஆணி.jpg",
                "ஏணி.jpg",
                "கணினி.jpg",
                "மணி.jpg"
            ]
        },
        {
            "கி முதல் னி வரை/தி": [
                "அதிரசம்.jpg",
                "கத்தி.jpg",
                "சுத்தியல்.jpg",
                "திசை.jpg",
                "திண்ணை.jpg",
                "தினை.jpg",
                "திருநீறு.jpg",
                "திரை.jpg",
                "திரையரங்கம்.jpg",
                "தீ.jpg",
                "மதி.jpg"
            ]
        },
        {
            "கி முதல் னி வரை/நி": [
                "நிறம்.jpg",
                "நிலக்கரி.jpg",
                "நிலம்.jpg",
                "நிலா.jpg",
                "நிழற்குடை.jpg",
                "நிழல்.jpg"
            ]
        },
        {
            "கி முதல் னி வரை/னி": [
                "இனிப்பு.jpg",
                "கணினி.jpg",
                "கனி.jpg",
                "பனி.jpg",
                "விமானி.jpg"
            ]
        },
        {
            "கி முதல் னி வரை/பி": [
                "சிப்பி.jpg",
                "தும்பி.jpg",
                "தும்பிக்கை.jpg",
                "பிதா.jpg",
                "பிறை.jpg",
                "பிளவு.jpg"
            ]
        },
        {
            "கி முதல் னி வரை/மி": [
                "அம்மி.jpg",
                "மிதியடி.jpg",
                "மின்னல்.jpg",
                "மின்மினி.jpg",
                "மிருகம்.jpg"
            ]
        },
        {
            "கி முதல் னி வரை/யி": [
                "கயிறு.jpg",
                "குயில்.jpg",
                "தயிர்.jpg",
                "பயிர்.jpg",
                "பயிறு.jpg",
                "மயில்.jpg"
            ]
        },
        {
            "கி முதல் னி வரை/ரி": [
                "அரிசி.jpg",
                "உரி.jpg",
                "எரிமலை.gif",
                "ஏரி.jpg",
                "கரி.jpg",
                "நரி.jpg",
                "பரிசல்.jpg",
                "பரிசு.jpg",
                "பூரி.jpg",
                "ரிஷி.jpg"
            ]
        },
        {
            "கி முதல் னி வரை/றி": [
                "காய்கறி.jpg",
                "பன்றி.jpg",
                "வெற்றிலை.jpg"
            ]
        },
        {
            "கி முதல் னி வரை/லி": [
                "எலி.jpg",
                "நாற்காலி.jpg",
                "பல்லி.jpg",
                "புலி.jpg",
                "முக்காலி.jpg",
                "லிங்கம்.jpeg"
            ]
        },
        {
            "கி முதல் னி வரை/ளி": [
                "களி.jpg",
                "காளி.jpg",
                "கிளி.jpg",
                "தக்காளி.jpg",
                "பப்பாளி.jpg",
                "பள்ளி.jpg",
                "வாளி.jpg",
                "வெளிச்சம்.jpg",
                "வெள்ளி.jpg"
            ]
        },
        {
            "கி முதல் னி வரை/ழி": [
                "அகழி.jpg",
                "குழி.jpg",
                "தோழி.jpg",
                "வில்.jpg",
                "விழி.jpg"
            ]
        },
        {
            "கி முதல் னி வரை/வி": [
                "அருவி.jpg",
                "விசிறி.jpg",
                "விபூதி.jpg",
                "விறகு.jpg",
                "விலங்கு.jpg",
                "விளக்கு.jpg",
                "விளையாட்டு.jpg",
                "விழுது.jpg"
            ]
        }
    ]
},
{
    "கீ முதல் னிவரை": [
        {
            "கீ முதல் னிவரை/கீ": [
                "கீதம்.jpg",
                "கீரி.jpg",
                "கீரை.jpg",
                "கீழாநெல்லி.jpg",
                "தேசிய கீதம்.jpg"
            ]
        },
        {
            "கீ முதல் னிவரை/சீ": [
                "சீடன்.jpg",
                "சீடை.jpg",
                "சீட்டு.jpg",
                "சீத்தாப்பழம்.jpg",
                "சீப்பு.jpg",
                "சீம்பால்.jpg",
                "சீயக்காய்.jpg",
                "சீரகம்.jpg",
                "சீருடை.jpg",
                "சீர்வரிசை.jpg",
                "சீவல்.jpg"
            ]
        },
        {
            "கீ முதல் னிவரை/ஞீ": []
        },
        {
            "கீ முதல் னிவரை/டீ": [
                "டீ.jpg"
            ]
        },
        {
            "கீ முதல் னிவரை/ணீ": [
                "கண்ணீர்.jpg",
                "தண்ணீர்.jpg"
            ]
        },
        {
            "கீ முதல் னிவரை/தீ": [
                "தீபம்.jpg",
                "தீபாவளி.jpg",
                "தீப்பெட்டி.jpg",
                "தீமிதி.jpg",
                "தீவு.jpg"
            ]
        },
        {
            "கீ முதல் னிவரை/நீ": [
                "நீலம்.jpg",
                "நீளம்.jpg"
            ]
        },
        {
            "கீ முதல் னிவரை/னீ": [
                "தேனீ.jpg",
                "பன்னீர்.jpg"
            ]
        },
        {
            "கீ முதல் னிவரை/பீ": []
        },
        {
            "கீ முதல் னிவரை/மீ": [
                "மீசை.jpg",
                "மீட்டர்.jpg",
                "மீத்தேன்.jpg",
                "மீனவர்.jpg",
                "மீன் கொத்தி.jpg",
                "மீன்.jpg"
            ]
        },
        {
            "கீ முதல் னிவரை/யீ": []
        },
        {
            "கீ முதல் னிவரை/ரீ": [
                "கிரீடம்.jpg"
            ]
        },
        {
            "கீ முதல் னிவரை/றீ": []
        },
        {
            "கீ முதல் னிவரை/லீ": [
                "கல்லீரல்.jpg"
            ]
        },
        {
            "கீ முதல் னிவரை/ளீ": []
        },
        {
            "கீ முதல் னிவரை/ழீ": []
        },
        {
            "கீ முதல் னிவரை/வீ": [
                "வீடு.jpg",
                "வீணை.jpg"
            ]
        }
    ]
},
{
    "கு முதல் னு வரை": [
        {
            "கு முதல் னு வரை/கு": [
                "குகை.jpg",
                "குடை மிளகாய்.jpg",
                "குடை.jpg",
                "குட்டை.jpg",
                "குதிரை.jpg",
                "குன்று.JPG",
                "குபேரன்.jpg",
                "குயவன்.jpg",
                "குயில்.jpg",
                "குரங்கு.jpg",
                "குறிஞ்சி மலர்.jpg",
                "குற்றாலம்.jpg",
                "குள்ளநரி.jpg",
                "குழந்தை.jpg"
            ]
        },
        {
            "கு முதல் னு வரை/ங்": []
        },
        {
            "கு முதல் னு வரை/சு": [
                "சுக்கு.jpg",
                "சுண்டக்காய்.jpg",
                "சுண்டல்.jpg",
                "சுண்டெலி.jpg",
                "சுண்ணாம்பு.jpg",
                "சுரங்கப்பாதை.jpg",
                "சுரைக்காய்.jpg",
                "சுறாமீன்.jpg",
                "சுழி.jpg"
            ]
        },
        {
            "கு முதல் னு வரை/ஞு": []
        },
        {
            "கு முதல் னு வரை/டு": [
                "அடுப்பு.jpg",
                "ஆடு.jpg",
                "ஓடு.jpg",
                "குடும்பம்.jpg",
                "கூடு.jpg",
                "தகடு.jpg",
                "துடுப்பு.jpg",
                "பட்டு.jpg",
                "பூட்டு.jpg",
                "மாடு.jpg",
                "மொட்டு.jpg",
                "வீடு.jpg"
            ]
        },
        {
            "கு முதல் னு வரை/ணு": [
                "அணு.jpg"
            ]
        },
        {
            "கு முதல் னு வரை/து": [
                "துணி.jpg",
                "தும்பி.jpg",
                "தும்பை.jpg",
                "துரித உணவு.jpg",
                "துறவி.jpg",
                "துளசி.jpg",
                "தூண்.jpg"
            ]
        },
        {
            "கு முதல் னு வரை/நு": [
                "நுங்கு.jpg",
                "நுரையீரல்.jpg"
            ]
        },
        {
            "கு முதல் னு வரை/னு": []
        },
        {
            "கு முதல் னு வரை/பு": [
                "புடவை.jpg",
                "புட்டு.jpg",
                "புதினா.jpg",
                "புதையல்.jpg",
                "புனல்.jpg",
                "புன்னகை.jpg",
                "புயல்.jpg",
                "புல்.jpg",
                "புஷ்பம்.jpg"
            ]
        },
        {
            "கு முதல் னு வரை/மு": [
                "முககவசம்.jpg",
                "முகப்பு.jpg",
                "முகமூடி.jpg",
                "முகம்.jpg",
                "முடக்கத்தான்.jpg",
                "முடி.jpg",
                "முட்டை.jpg",
                "முதலை.jpg",
                "முத்து.jpg",
                "முயல்.jpg"
            ]
        },
        {
            "கு முதல் னு வரை/யு": [
                "ஆயுதம்.jpg",
                "யுத்தம்.jpg"
            ]
        },
        {
            "கு முதல் னு வரை/ரு": [
                "இரும்பு.jpg",
                "குருவி.jpg",
                "நெருப்பு.jpg",
                "பருப்பு.jpg"
            ]
        },
        {
            "கு முதல் னு வரை/று": [
                "ஆறு.jpg",
                "உறுப்பு.jpg",
                "ஊற்று.jpg",
                "எறும்பு.jpg",
                "கயிறு.jpg",
                "பயிறு.jpg",
                "புற்று.jpg"
            ]
        },
        {
            "கு முதல் னு வரை/லு": [
                "எலுமிச்சை.jpeg",
                "எலும்பு.jpg"
            ]
        },
        {
            "கு முதல் னு வரை/ளு": [
                "உளுந்து.jpg",
                "எள்ளு.jpg",
                "கொள்ளு.jpg",
                "திருவள்ளுவர்.jpg"
            ]
        },
        {
            "கு முதல் னு வரை/ழு": [
                "அழுகை.jpg",
                "எழுத்து.jpg",
                "ஏழு.jpg",
                "கழுகு.jpg",
                "கழுத்து.jpg",
                "மண்புழு.jpg"
            ]
        },
        {
            "கு முதல் னு வரை/வு": [
                "கதவு.jpg",
                "சரிவு.jpg"
            ]
        }
    ]
},
{
    "கூ முதல் னூ வரை": [
        {
            "கூ முதல் னூ வரை/கூ": [
                "கூடாரம்.jpg",
                "கூடு.jpg",
                "கூடை.jpg",
                "கூட்டம்.jpg",
                "கூண்டு.jpg",
                "கூத்தாடி.jpg",
                "கூந்தல்.jpg",
                "கூனல்.jpg",
                "கூர்மை.jpg"
            ]
        },
        {
            "கூ முதல் னூ வரை/சூ": [
                "சூடம்.jpg",
                "சூரிய பகவான்.jpg",
                "சூரியகாந்தி.jpg",
                "சூரியன்.jpg",
                "சூரியமண்டலம்.jpg",
                "சூலம்.jpg"
            ]
        },
        {
            "கூ முதல் னூ வரை/ஞூ": []
        },
        {
            "கூ முதல் னூ வரை/டூ": [
                "குண்டூசி.jpg"
            ]
        },
        {
            "கூ முதல் னூ வரை/ணூ": [
                "எண்ணூறு.jpg"
            ]
        },
        {
            "கூ முதல் னூ வரை/தூ": [
                "தூசி.jpg",
                "தூண்.jpg",
                "தூண்டில்.jpg",
                "தூண்டுகோல்.jpg",
                "தூரிகை.jpg",
                "தூறல்.jpg",
                "தூவக்கால்.jpg"
            ]
        },
        {
            "கூ முதல் னூ வரை/நூ": [
                "நூல்.jpg"
            ]
        },
        {
            "கூ முதல் னூ வரை/னூ": [
                "வானூர்தி.jpg"
            ]
        },
        {
            "கூ முதல் னூ வரை/பூ": [
                "பூ.jpg",
                "பூட்டு.jpg",
                "பூண்டு.jpg",
                "பூனை.jpg",
                "பூமி.jpg",
                "பூரி.jpg"
            ]
        },
        {
            "கூ முதல் னூ வரை/மூ": [
                "மூங்கில்.jpg",
                "மூடி.jpg",
                "மூளை.jpg"
            ]
        },
        {
            "கூ முதல் னூ வரை/யூ": []
        },
        {
            "கூ முதல் னூ வரை/ரூ": []
        },
        {
            "கூ முதல் னூ வரை/றூ": []
        },
        {
            "கூ முதல் னூ வரை/லூ": [
                "வல்லூறு.jpg"
            ]
        },
        {
            "கூ முதல் னூ வரை/ளூ": []
        },
        {
            "கூ முதல் னூ வரை/ழூ": []
        },
        {
            "கூ முதல் னூ வரை/வூ": []
        }
    ]
},
{
    "கெ முதல் னெ வரை": [
        {
            "கெ முதல் னெ வரை/கெ": [
                "கெட்டிமேளம்.jpg",
                "கெண்டி.jpg",
                "கெவுளி.jpeg"
            ]
        },
        {
            "கெ முதல் னெ வரை/செ": [
                "செக்கு.jpg",
                "செங்கதிர்.jpg",
                "செங்கல்.jpg",
                "செடி.jpg",
                "சென்னை.jpg",
                "செப்பு.jpg",
                "செம்மண்.jpg",
                "செம்மொழி.jpg",
                "செருப்பு.jpg",
                "சேவல்.jpg"
            ]
        },
        {
            "கெ முதல் னெ வரை/ஞே": []
        },
        {
            "கெ முதல் னெ வரை/டெ": [
                "கட்டெறும்பு.jpg",
                "காட்டெருமை.jpg",
                "சுண்டெலி.jpg",
                "டெல்லி.jpg"
            ]
        },
        {
            "கெ முதல் னெ வரை/ணெ": [
                "எண்ணெய்.jpg",
                "வெண்ணெய்.jpg"
            ]
        },
        {
            "கெ முதல் னெ வரை/தெ": [
                "தெப்பம்.jpg",
                "தெரு.jpg"
            ]
        },
        {
            "கெ முதல் னெ வரை/நெ": [
                "நெய்.jpg",
                "நெருப்பு.jpg",
                "நெற்றி.jpg",
                "நெல்.jpg",
                "நெல்லிக்காய்.jpg"
            ]
        },
        {
            "கெ முதல் னெ வரை/பெ": [
                "பெட்டி.jpg"
            ]
        },
        {
            "கெ முதல் னெ வரை/மெ": [
                "மெட்டி.jpg",
                "மெழுகுவர்த்தி.jpg"
            ]
        },
        {
            "கெ முதல் னெ வரை/ரெ": []
        },
        {
            "கெ முதல் னெ வரை/றெ": [
                "சிற்றெறும்பு.jpg"
            ]
        },
        {
            "கெ முதல் னெ வரை/லெ": []
        },
        {
            "கெ முதல் னெ வரை/லே": []
        },
        {
            "கெ முதல் னெ வரை/வெ": [
                "வெடி.jpg",
                "வெட்டுக்கிளி.jpg",
                "வெண்ணெய்.jpg",
                "வெல்லம்.jpg",
                "வெள்ளரி.jpg"
            ]
        }
    ]
},
{
    "கெள முதல் னெள வரை": [
        {
            "கெள முதல் னெள வரை/கெள": [
                "கெளதாரி.jpg",
                "கெளளி.jpg",
                "கௌசிகம்.jpg"
            ]
        },
        {
            "கெள முதல் னெள வரை/செள": [
                "செளசெள.jpg"
            ]
        }
    ]
},
{
    "கொ முதல் னொ  வரை": [
        {
            "கொ முதல் னொ  வரை/கொ": [
                "கொசு.jpg",
                "கொடி.jpg",
                "கொன்னை.jpg",
                "கொம்பு.jpg",
                "கொலுசு.jpg"
            ]
        },
        {
            "கொ முதல் னொ  வரை/சொ": [
                "சொல்.jpg"
            ]
        },
        {
            "கொ முதல் னொ  வரை/டெ": []
        },
        {
            "கொ முதல் னொ  வரை/தொ": [
                "தொடர்வண்டி.jpg",
                "தொட்டி.jpg",
                "தொப்பி.jpg",
                "தொலைக்காட்சி.jpg"
            ]
        },
        {
            "கொ முதல் னொ  வரை/னொ": [
                "வானொலி.jpg"
            ]
        },
        {
            "கொ முதல் னொ  வரை/பொ": [
                "பொம்மலாட்டம்.jpg",
                "பொம்மை.jpg",
                "பொரி.jpg",
                "பொற்காசு.jpg"
            ]
        },
        {
            "கொ முதல் னொ  வரை/மொ": [
                "மொட்டு.jpg",
                "மொட்டை.JPG",
                "மொய்.jpg"
            ]
        },
        {
            "கொ முதல் னொ  வரை/யொ": [
                "கையொப்பம்.jpg"
            ]
        },
        {
            "கொ முதல் னொ  வரை/ரொ": [
                "ரொட்டி.jpg"
            ]
        },
        {
            "கொ முதல் னொ  வரை/லொ": []
        },
        {
            "கொ முதல் னொ  வரை/ழொ": []
        },
        {
            "கொ முதல் னொ  வரை/வொ": []
        }
    ]
},
{
    "கே முதல் னே வரை": [
        {
            "கே முதல் னே வரை/கே": [
                "கேசரி.jpg",
                "கேள்.jpg",
                "கேழ்வரகு.jpg"
            ]
        },
        {
            "கே முதல் னே வரை/சே": [
                "சேனை.jpg",
                "சேய்.jpg",
                "சேரன்.jpg",
                "சேர்.jpg"
            ]
        },
        {
            "கே முதல் னே வரை/ஞே": []
        },
        {
            "கே முதல் னே வரை/டே": []
        },
        {
            "கே முதல் னே வரை/தே": [
                "தேக்கு.jpg",
                "தேங்காய்.jpg",
                "தேநீர்.jpg",
                "தேனீ.jpg",
                "தேன்.jpg",
                "தேர்.jpg",
                "தேள்.jpg",
                "விதை.jpg"
            ]
        },
        {
            "கே முதல் னே வரை/நே": [
                "நேரம்.jpg"
            ]
        },
        {
            "கே முதல் னே வரை/னே": []
        },
        {
            "கே முதல் னே வரை/பே": [
                "பேனா.jpg",
                "பேருந்து.jpg"
            ]
        },
        {
            "கே முதல் னே வரை/மே": [
                "மேகம்.jpg",
                "மேடு.jpg"
            ]
        },
        {
            "கே முதல் னே வரை/யே": []
        },
        {
            "கே முதல் னே வரை/ரே": []
        },
        {
            "கே முதல் னே வரை/லே": []
        },
        {
            "கே முதல் னே வரை/ளே": []
        },
        {
            "கே முதல் னே வரை/ழே": []
        },
        {
            "கே முதல் னே வரை/வே": [
                "வேம்பு.jpg",
                "வேர்.jpg",
                "வேலமரம்.JPG",
                "வேலி.jpg",
                "வேல்.jpg"
            ]
        }
    ]
},
{
    "கோ முதல்  னோ வரை": [
        {
            "கோ முதல்  னோ வரை/கோ": [
                "கோ.jpg",
                "கோடரி.jpg",
                "கோடு.jpeg",
                "கோடை.jpg",
                "கோணி.jpg",
                "கோதுமை.jpg",
                "கோலம்.jpg",
                "கோள்கள்.jpg",
                "கோழி.jpg"
            ]
        },
        {
            "கோ முதல்  னோ வரை/சோ": [
                "சோப்பு.jpg",
                "சோம்பு.jpg",
                "சோயா.jpg",
                "சோறு.jpg",
                "சோலை.jpg",
                "சோளம்.jpg",
                "சோழநாடு.jpg"
            ]
        },
        {
            "கோ முதல்  னோ வரை/ஞோ": []
        },
        {
            "கோ முதல்  னோ வரை/டோ": []
        },
        {
            "கோ முதல்  னோ வரை/தோ": [
                "தோகை.jpg",
                "தோசை.jpg",
                "தோடு.jpg",
                "தோட்டம்.jpg",
                "தோல்.jpg",
                "தோழன்.jpg",
                "தோழி.jpg",
                "நொச்சி.jpg",
                "நோயாளி.jpg",
                "நோய்.jpg"
            ]
        },
        {
            "கோ முதல்  னோ வரை/நோ": []
        },
        {
            "கோ முதல்  னோ வரை/னோ": []
        },
        {
            "கோ முதல்  னோ வரை/போ": [
                "போகன்.jpg",
                "போட்டி.jpg"
            ]
        },
        {
            "கோ முதல்  னோ வரை/மோ": [
                "மோதிரம்.jpg",
                "மோர்.jpg"
            ]
        },
        {
            "கோ முதல்  னோ வரை/யோ": [
                "அலையோசை.jpg",
                "யோகா.jpg",
                "யோகி.jpg",
                "வளையோசை.jpg"
            ]
        },
        {
            "கோ முதல்  னோ வரை/ரோ": [
                "ரோஜா.jpg",
                "ரோமம்.jpg"
            ]
        },
        {
            "கோ முதல்  னோ வரை/றோ": [
                "சான்றோர்.jpg",
                "பெற்றோர்.jpg"
            ]
        },
        {
            "கோ முதல்  னோ வரை/லோ": [
                "விரலோவியம்.jpg"
            ]
        },
        {
            "கோ முதல்  னோ வரை/ளோ": []
        },
        {
            "கோ முதல்  னோ வரை/ழோ": [
                {
                    "கோ முதல்  னோ வரை/ழோ/போ": []
                }
            ]
        },
        {
            "கோ முதல்  னோ வரை/வோ": []
        }
    ]
},
{
    "கை முதல் னை வரை": [
        {
            "கை முதல் னை வரை/கை": [
                "உலக்கை.jpg",
                "கங்கை.jpg",
                "காக்கை.jpg",
                "குகை.jpg",
                "கை.jpg",
                "கைத்தடி.jpg",
                "கைத்தறி.jpg",
                "தோகை.jpg",
                "நகை.jpg",
                "புகை.jpg",
                "மங்கை.jpg",
                "மல்லிகை.jpg",
                "மாளிகை.jpg",
                "முருங்கை.jpg"
            ]
        },
        {
            "கை முதல் னை வரை/சை": [
                "இசை.jpg",
                "ஓசை.jpg",
                "மீசை.jpg"
            ]
        },
        {
            "கை முதல் னை வரை/ஞை": []
        },
        {
            "கை முதல் னை வரை/டை": [
                "அடை.jpg",
                "அட்டை.jpg",
                "ஆடை.jpg",
                "ஓடை.jpg",
                "கடை.jpg",
                "குடை.jpg",
                "கூடை.jpg",
                "சட்டை.jpg",
                "சீடை.jpg",
                "தட்டை.jpg",
                "படை.jpg",
                "மேடை.jpg",
                "வெண்டை.jpg"
            ]
        },
        {
            "கை முதல் னை வரை/ணை": [
                "அணை.jpg",
                "பண்ணை.jpg"
            ]
        },
        {
            "கை முதல் னை வரை/தை": [
                "கீதை.jpg",
                "தை.jpg",
                "தையல்.jpg",
                "தைலம்.jpg",
                "பாதை.jpg",
                "பேதை.jpg",
                "மேதை.jpg",
                "விதை.jpeg"
            ]
        },
        {
            "கை முதல் னை வரை/நை": []
        },
        {
            "கை முதல் னை வரை/னை": [
                "சென்னை.jpg",
                "தென்னை.jpg",
                "பனை.jpg",
                "பானை.jpg",
                "மனை.jpg",
                "யானை.jpg"
            ]
        },
        {
            "கை முதல் னை வரை/பை": [
                "பை.jpg",
                "பையன்.jpg"
            ]
        },
        {
            "கை முதல் னை வரை/மை": [
                "ஆமை.jpg",
                "இமை.jpg",
                "சாமை.jpg",
                "மை.jpg"
            ]
        },
        {
            "கை முதல் னை வரை/யை": []
        },
        {
            "கை முதல் னை வரை/ரை": [
                "அவரை.jpg",
                "கீரை.jpg",
                "குதிரை.jpg",
                "கூரை.jpeg",
                "தாமரை.jpg",
                "நரை.jpg"
            ]
        },
        {
            "கை முதல் னை வரை/றை": [
                "பாறை.jpg",
                "பிறை.jpg"
            ]
        },
        {
            "கை முதல் னை வரை/லை": [
                "அலை.jpg",
                "இலை.jpg",
                "ஓலை.jpg",
                "கலை.jpg",
                "சாலை.jpg",
                "தலை.jpg",
                "மலை.jpg",
                "வலை.jpg",
                "வெற்றிலை.jpg"
            ]
        },
        {
            "கை முதல் னை வரை/ளை": [
                "கிளை.jpg",
                "தவளை.jpg",
                "மூளை.jpg",
                "வளையல்.jpg",
                "வெள்ளை.jpg"
            ]
        },
        {
            "கை முதல் னை வரை/ழை": [
                "அழைப்பிதல்.jpg",
                "கழை.jpeg",
                "வாழை.jpg"
            ]
        },
        {
            "கை முதல் னை வரை/வை": [
                "வைக்கோல்.jpg",
                "வைத்தியர்.jpg",
                "வைரம்.jpg"
            ]
        }
    ]
},
{
    "க் முதல் ன் வரை": [
        {
            "க் முதல் ன் வரை/க்": [
                "ஏலக்காய்.jpg",
                "கொக்கு.jpg",
                "கைக்குட்டை.jpg",
                "சக்கரம்.jpg",
                "சர்க்கரை.jpg",
                "தக்காளி.jpg",
                "தேக்கு.jpg",
                "பாக்கு.jpg",
                "முக்காலி.jpg",
                "முக்கோணம்.jpg",
                "முறுக்கு.jpg",
                "விளக்கு.jpg"
            ]
        },
        {
            "க் முதல் ன் வரை/ங்": [
                "குரங்கு.jpg",
                "சங்கு.jpg",
                "சிங்கம்.jpg",
                "செங்கல்.jpg",
                "திமிங்கலம்.jpg",
                "தேங்காய்.jpg",
                "நுங்கு.jpg",
                "பீரங்கி.jpg",
                "பூங்கொத்து.jpg",
                "மாங்காய்.jpg",
                "மூங்கில்.jpg",
                "வெங்காயம்.jpg"
            ]
        },
        {
            "க் முதல் ன் வரை/ச்": [
                "அச்சாணி.jpg",
                "ஈச்சமரம்.jpg",
                "எலுமிச்சை.jpg",
                "ஓலைச்சுவடி.jpg",
                "குச்சி.jpg",
                "தச்சன்.jpg",
                "பச்சை.jpg",
                "பூச்சி.jpg",
                "பூச்செண்டு.jpg",
                "பேரிச்சை.jpg",
                "மச்சம்.jpg",
                "மொச்சை.jpg"
            ]
        },
        {
            "க் முதல் ன் வரை/ஞ்": [
                "அஞ்சல்.jpg",
                "ஆரஞ்சு.jpg",
                "இஞ்சி.jpg",
                "ஊஞ்சல்.jpg",
                "கஞ்சி.jpg",
                "களஞ்சியம்.jpg",
                "கொஞ்சும்.jpg",
                "பஞ்சு.jpg",
                "பிஞ்சு.jpg",
                "பூஞ்சோலை.jpg",
                "மஞ்சள்.jpg",
                "விஞ்ஞானி.jpg"
            ]
        },
        {
            "க் முதல் ன் வரை/ட்": [
                "ஈட்டி.jpg",
                "எட்டு.jpg",
                "சட்டை.jpg",
                "சாட்டை.jpg",
                "தட்டு.jpg",
                "பட்டம்.jpg",
                "புட்டு.jpg",
                "பூட்டு.jpg",
                "பெட்டி.jpg",
                "முட்டை.jpg",
                "மூட்டை.jpg",
                "மொட்டு.jpg",
                "லட்டு.jpg",
                "வட்டம்.jpg"
            ]
        },
        {
            "க் முதல் ன் வரை/ண்": [
                "கண்.jpg",
                "கண்ணாடி.jpg",
                "கிண்ணம்.jpg",
                "சுண்டை.jpg",
                "தண்ணீர்.jpg",
                "நண்டு.jpg",
                "பூண்டு.jpg",
                "மண்.jpg",
                "மண்பானை.jpg",
                "வண்டி.jpg",
                "வண்டு.jpg",
                "வண்ணத்துபூச்சி.jpg",
                "வெண்டை.jpg"
            ]
        },
        {
            "க் முதல் ன் வரை/த்": [
                "அத்தி.jpg",
                "கத்தி.jpg",
                "சுத்தி.jpg",
                "தாத்தா.jpg",
                "நத்தை.jpg",
                "பத்து.jpg",
                "புத்தகம்.jpg",
                "மத்தளம்.jpg",
                "மத்து.jpg",
                "மெத்தை.jpg",
                "வாத்து.jpg"
            ]
        },
        {
            "க் முதல் ன் வரை/ந்": [
                "அந்திமல்லி.jpg",
                "ஆந்தை.jpg",
                "சந்திரன்.jpg",
                "சாமந்தி.jpg",
                "சிலந்தி.jpg",
                "தந்தம்.jpg",
                "நந்தி.jpg",
                "பந்து.jpg",
                "பொந்து.jpg",
                "பேருந்து.jpg",
                "மகிழுந்து.jpg",
                "முந்திரி.jpg",
                "வெந்தயம்.jpg"
            ]
        },
        {
            "க் முதல் ன் வரை/ன்": [
                "அன்னம்.jpg",
                "கடல் கன்னி.jpg",
                "கன்று.jpg",
                "காளான்.jpg",
                "சூரியன்.jpg",
                "தென்னை.jpg",
                "தேன்.jpg",
                "பன்றி.jpeg",
                "பென்சில்.jpg",
                "மான்.png",
                "மீன்.jpg"
            ]
        },
        {
            "க் முதல் ன் வரை/ப்": [
                "உப்பு.jpg",
                "கப்பல்.jpg",
                "காப்பு.jpg",
                "சீப்பு.jpg",
                "சோப்பு.jpg",
                "தொப்பி.jpg",
                "பப்பாளி.jpg",
                "வாழைப்பூ.jpg"
            ]
        },
        {
            "க் முதல் ன் வரை/ம்": [
                "காகம்.jpg",
                "தும்பி.jpg",
                "பம்பரம்.jpg",
                "மரம்.jpg",
                "மேகம்.jpg",
                "மேளம்.jpg",
                "வானம்.jpg"
            ]
        },
        {
            "க் முதல் ன் வரை/ய்": [
                "ஊறுகாய்.jpg",
                "காய்.jpg",
                "கொய்யா.jpg",
                "நாய்.jpg",
                "நெய்.jpg",
                "பாய்.jpg",
                "மிளகாய்.jpg",
                "வெண்ணெய்.jpg"
            ]
        },
        {
            "க் முதல் ன் வரை/ர்": [
                "இளநீர்.jpg",
                "ஊர்தி.jpg",
                "காவலர்.jpg",
                "தொடர்வண்டி.jpg",
                "தேர்.jpg",
                "மலர்.jpg",
                "மெழுகுவர்த்தி.jpg",
                "மோர்.jpg"
            ]
        },
        {
            "க் முதல் ன் வரை/ற்": [
                "இயற்கை.jpg",
                "கற்பூரம்.jpg",
                "காற்றலை.jpg",
                "சிற்பம்.jpg",
                "சிற்பி.jpg",
                "நாற்காலி.jpg",
                "புற்று.jpg",
                "வெற்றிலை.jpg"
            ]
        },
        {
            "க் முதல் ன் வரை/ல்": [
                "அணில்.jpg",
                "கடல்.jpg",
                "குயில்.jpg",
                "சேவல்.jpg",
                "நெல்.jpg",
                "பல்.jpg",
                "மயில்.jpg",
                "முயல்.jpg",
                "வளையல்.jpg",
                "வானவில்.jpg"
            ]
        },
        {
            "க் முதல் ன் வரை/ள்": [
                "ஆப்பிள்.jpg",
                "தேள்.jpg",
                "பள்ளிக்கூடம்.jpg",
                "முள்.jpg",
                "முள்ளங்கி.jpg",
                "வாள்.jpg",
                "வெள்ளரி.jpg"
            ]
        },
        {
            "க் முதல் ன் வரை/ழ்": [
                "ஆழ்துளை.jpg",
                "கேழ்வரகு.jpg",
                "தாழ்ப்பாழ்.jpg",
                "யாழ்.jpg"
            ]
        },
        {
            "க் முதல் ன் வரை/வ்": [
                "கொவ்வை.jpg",
                "சவ்வாது.jpg",
                "செவ்வகம்.jpg",
                "செவ்வந்தி.jpg",
                "செவ்வரளி.jpg",
                "செவ்வானம்.jpg",
                "செவ்வாழை.jpg"
            ]
        }
    ]
}
]

export default function Id(props) {
    const router = useRouter()
    const { id } = router.query
    console.log(id);
    return (
        <>

            <div className="bg-gray-100  h-full h-screen">

                <div className="  mx-auto max-w-4xl   sm:py-28 sm:px-10 object-cover h-96 w-full lg:max-w-2xl lg:px-10">
                    <div className="  text-4xl px-16 font-bold tracking-tight text-gray-900">
                        <div className=' inline-block px-4'>
                            <img
                                src={`${id}.png`}
                                className="h-10 w-10 inline-block " />
                        </div>
                        Letters
                    </div>
                    <div className='py-10 rounded-lg'>
                        <Carousel>
                            {id && data[id].map((product) => (
                                <>
                                    <div className='object-cover'>
                                        <div className=" bg-gray-200  xl:h-96">
                                            <img
                                                src={product.imgSrc}
                                                className="h-full w-full object-cover "
                                            />
                                        </div>
                                        <div className=" text-center font-bold  first-letter:text-blue-700 text-red-500  text-2xl">
                                            {product.name}
                                        </div>
                                    </div>

                                </>
                            ))}
                        </Carousel>
                    </div>

                </div>
            </div>
        </>

    )
}